read_verilog paralelo_serial2.v
hierarchy -check -top paralelo_serial2
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty UTILIDADES/cmos_cells.lib
abc -liberty UTILIDADES/cmos_cells.lib
clean
write_verilog synth_paralelo_serial2.v