read_verilog W.v
hierarchy -check -top W
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty UTILIDADES/cmos_cells.lib
abc -liberty UTILIDADES/cmos_cells.lib
clean
write_verilog synth_W.v