read_verilog mux4x2_8bits.v
hierarchy -check -top mux4x2_8bits
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty UTILIDADES/cmos_cells.lib
abc -liberty UTILIDADES/cmos_cells.lib
clean
write_verilog synth_mux4x2_8bits.v