read_verilog PPRX.v
hierarchy -check -top PPRX
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty UTILIDADES/cmos_cells.lib
abc -liberty UTILIDADES/cmos_cells.lib
clean
write_verilog synth_PPRX.v