read_verilog serial_paralelo1.v
hierarchy -check -top serial_paralelo1
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty UTILIDADES/cmos_cells.lib
abc -liberty UTILIDADES/cmos_cells.lib
clean
write_verilog synth_serial_paralelo1.v