read_verilog phy_tx.v
hierarchy -check -top phy_tx
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty UTILIDADES/cmos_cells.lib
abc -liberty UTILIDADES/cmos_cells.lib
clean
write_verilog synth_phy_tx.v