read_verilog demux1x2_8bits.v
hierarchy -check -top demux1x2_8bits
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty UTILIDADES/cmos_cells.lib
abc -liberty UTILIDADES/cmos_cells.lib
clean
write_verilog synth_demux1x2_8bits.v